build-essential
cmake
pkg-config
git
curl
wget
unzip
xz-utils
p7zip-full
ca-certificates
gnupg
lsb-release
jq
software-properties-common
python3
python3-pip
python3-venv
python3-dev
openjdk-17-jre-headless
openjdk-17-jdk
gdb
gdbserver
gdb-multiarch
lldb
strace
ltrace
file
tmux
zsh
less
ripgrep
silversearcher-ag
fd-find
vim
nano
netcat-openbsd
socat
tcpdump
nmap
masscan
wireshark
tshark
iproute2
iputils-ping
traceroute
dnsutils
binwalk
foremost
sleuthkit
exiftool
steghide
stegsnow
ffmpeg
john
hashcat
sqlite3
patchelf
binutils
ffuf
genisoimage
squashfs-tools
device-tree-compiler
u-boot-tools
mtd-utils
qemu-user-static
binfmt-support
bsdiff
bspatch
lz4
zstd
lzop
cpio
cabextract
openocd
stlink-tools
dfu-util
flashrom
liblzo2-dev
android-tools-adb
android-tools-fastboot
android-sdk-platform-tools-common
apktool
libsmali-java
mitmproxy
bc
flex
bison
libssl-dev
libelf-dev
libncurses-dev
ccache
zlib1g-dev
qemu-system-x86
qemu-utils
yara
python3-yara
checksec
flatpak
xdg-utils
xvfb
